```
=========> Existing resources:
module.acr.data.azurerm_container_registry_scope_map.pull
module.acr.data.azurerm_container_registry_scope_map.push
module.acr.azurerm_container_registry.this
module.acr.azurerm_container_registry_token.pull
module.acr.azurerm_container_registry_token.push
module.acr.azurerm_container_registry_token_password.pull_password
module.acr.azurerm_container_registry_token_password.push_password
module.acr.azurerm_private_dns_a_record.data
module.acr.azurerm_private_dns_a_record.login_server
module.acr.azurerm_private_dns_zone.pdz
module.acr.azurerm_private_dns_zone_virtual_network_link.vnetlink_private
module.acr.azurerm_private_endpoint.pep
module.acr.azurerm_subnet.acr
module.acr.azurerm_subnet.container_apps
module.acr.azurerm_virtual_network.vnet
module.container_apps.azurerm_application_insights.this
module.docker_image.docker_image.proxy
module.docker_image.docker_registry_image.proxy
module.docker_image.null_resource.go_code_keeper
module.endpoint_blob.azurerm_storage_account.endpoint
module.endpoint_blob.azurerm_storage_blob.endpoint
module.endpoint_blob.azurerm_storage_container.endpoint
module.resource_group.azurerm_resource_group.this
module.acr.module.public_ip.data.curl.big_data_cloud
module.container_apps.module.telemetry_proxy.azurerm_container_app.container_app["telemetry_proxy"]
module.container_apps.module.telemetry_proxy.azurerm_container_app_environment.container_env
module.container_apps.module.telemetry_proxy.azurerm_log_analytics_workspace.laws[0]
module.acr.module.public_ip.data.curl.big_data_cloud: Reading...
module.docker_image.null_resource.go_code_keeper: Refreshing state... [id=5687990542757276323]
module.acr.module.public_ip.data.curl.big_data_cloud: Read complete after 0s [id=1728549508]
module.resource_group.azurerm_resource_group.this: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry]
module.container_apps.azurerm_application_insights.this: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Insights/components/avm-telemetry]
module.acr.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Network/virtualNetworks/telemetry]
module.acr.azurerm_private_dns_zone.pdz: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io]
module.container_apps.module.telemetry_proxy.azurerm_log_analytics_workspace.laws[0]: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.OperationalInsights/workspaces/telemetry-proxy-log-analytics-workspace]
module.endpoint_blob.azurerm_storage_account.endpoint: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Storage/storageAccounts/avmtftelemetrysvc]
module.acr.azurerm_subnet.container_apps: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Network/virtualNetworks/telemetry/subnets/containerapps]
module.acr.azurerm_subnet.acr: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Network/virtualNetworks/telemetry/subnets/acr]
module.acr.azurerm_container_registry.this: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.ContainerRegistry/registries/avmtelemetry]
module.container_apps.module.telemetry_proxy.azurerm_container_app_environment.container_env: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.App/managedEnvironments/telemetry-proxy]
module.acr.azurerm_private_dns_zone_virtual_network_link.vnetlink_private: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io/virtualNetworkLinks/mydnslink]
module.acr.azurerm_container_registry_token.pull: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.ContainerRegistry/registries/avmtelemetry/tokens/pull-token]
module.acr.azurerm_container_registry_token.push: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.ContainerRegistry/registries/avmtelemetry/tokens/push-token]
module.acr.azurerm_private_endpoint.pep: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Network/privateEndpoints/mype]
module.acr.azurerm_container_registry_token_password.push_password: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.ContainerRegistry/registries/avmtelemetry/tokens/push-token/passwords/password]
module.acr.azurerm_container_registry_token_password.pull_password: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.ContainerRegistry/registries/avmtelemetry/tokens/pull-token/passwords/password]
module.docker_image.docker_image.proxy: Refreshing state... [id=sha256:9c62bb96fdafa96ecb9430b43f7588246b9653c0b3b04036181e75c98d1ccbe5avmtelemetry.azurecr.io/telemetry_proxy]
module.docker_image.docker_registry_image.proxy: Refreshing state... [id=sha256:86460aca4c93f164dc67b82c5cb73cc469a8b6309bc572f9db17dbf6715f17f9]
module.acr.azurerm_private_dns_a_record.login_server: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io/A/avmtelemetry]
module.acr.azurerm_private_dns_a_record.data: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io/A/avmtelemetry.eastus.data]
module.container_apps.module.telemetry_proxy.azurerm_container_app.container_app["telemetry_proxy"]: Refreshing state... [id=/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.App/containerApps/telemetry-proxy]
module.endpoint_blob.azurerm_storage_container.endpoint: Refreshing state... [id=https://avmtftelemetrysvc.blob.core.windows.net/blob]
module.endpoint_blob.azurerm_storage_blob.endpoint: Refreshing state... [id=https://avmtftelemetrysvc.blob.core.windows.net/blob/endpoint]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.docker_image.docker_image.proxy has been deleted
  - resource "docker_image" "proxy" {
        id          = "sha256:9c62bb96fdafa96ecb9430b43f7588246b9653c0b3b04036181e75c98d1ccbe5avmtelemetry.azurecr.io/telemetry_proxy"
      - name        = "avmtelemetry.azurecr.io/telemetry_proxy" -> null
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.docker_image.docker_registry_image.proxy has been deleted
  - resource "docker_registry_image" "proxy" {
        id                   = "sha256:86460aca4c93f164dc67b82c5cb73cc469a8b6309bc572f9db17dbf6715f17f9"
      - name                 = "avmtelemetry.azurecr.io/telemetry_proxy" -> null
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.acr.data.azurerm_container_registry_scope_map.pull will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_container_registry_scope_map" "pull" {
      + actions                 = (known after apply)
      + container_registry_name = "avmtelemetry"
      + description             = (known after apply)
      + id                      = (known after apply)
      + name                    = "_repositories_pull"
      + resource_group_name     = "avm-telemetry"
    }

  # module.acr.data.azurerm_container_registry_scope_map.push will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_container_registry_scope_map" "push" {
      + actions                 = (known after apply)
      + container_registry_name = "avmtelemetry"
      + description             = (known after apply)
      + id                      = (known after apply)
      + name                    = "_repositories_push"
      + resource_group_name     = "avm-telemetry"
    }

  # module.acr.azurerm_container_registry.this will be updated in-place
  ~ resource "azurerm_container_registry" "this" {
        id                            = "/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.ContainerRegistry/registries/avmtelemetry"
        name                          = "avmtelemetry"
      ~ network_rule_set              = [
          ~ {
              ~ ip_rule         = (sensitive value)
                # (2 unchanged attributes hidden)
            },
        ]
        tags                          = {}
        # (17 unchanged attributes hidden)
    }

  # module.docker_image.docker_image.proxy will be created
  + resource "docker_image" "proxy" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "avmtelemetry.azurecr.io/telemetry_proxy"
      + repo_digest = (known after apply)
      + triggers    = {
          + "code_hash"  = "5418a8a85f5e5c1beda2166908f175a3"
          + "dockerfile" = "55bd302135967045970190be50f8eeb0"
        }

      + build {
          + cache_from     = []
          + context        = "docker_image"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + remove         = true
          + security_opt   = []
          + tag            = [
              + "avmtelemetry.azurecr.io/telemetry_proxy:latest",
            ]
            # (11 unchanged attributes hidden)
        }
    }

  # module.docker_image.docker_registry_image.proxy will be created
  + resource "docker_registry_image" "proxy" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = true
      + name                 = "avmtelemetry.azurecr.io/telemetry_proxy"
      + sha256_digest        = (known after apply)
    }

  # module.docker_image.null_resource.go_code_keeper must be replaced
-/+ resource "null_resource" "go_code_keeper" {
      ~ id       = "5687990542757276323" -> (known after apply)
      ~ triggers = { # forces replacement
          + "go_mod"     = "b0a77f1d284022a72692b7d2ba609f2a"
          + "go_sum"     = "04d4b7013a16be5321ebff61dce8b5c4"
            # (2 unchanged elements hidden)
        }
    }

  # module.endpoint_blob.azurerm_storage_account.endpoint will be updated in-place
  ~ resource "azurerm_storage_account" "endpoint" {
        id                                 = "/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Storage/storageAccounts/avmtftelemetrysvc"
        name                               = "avmtftelemetrysvc"
        tags                               = {}
        # (97 unchanged attributes hidden)

      ~ network_rules {
            # (4 unchanged attributes hidden)

          - private_link_access {
              - endpoint_resource_id = "/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/providers/Microsoft.Security/datascanners/storageDataScanner" -> null
              - endpoint_tenant_id   = "fc2bf966-a984-438c-93b7-bc5a06fe7f0d" -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 2 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.acr.azurerm_container_registry.this,
  on acr/main.tf line 20, in resource "azurerm_container_registry" "this":
  20:     virtual_network {

The property `virtual_network` is deprecated since this is used exclusively
for service endpoints which are being deprecated. Users are expected to use
Private Endpoints instead. This property will be removed in v4.0 of the
AzureRM Provider.

(and 4 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```